
#+BEGIN_EXPORT LaTeX
\title[Ice sheet mass flows]{Ice sheet mass flows}

\author[Mankoff and others]
{Kenneth D. MANKOFF$^{1,2}$,
Chad A. GREENE$^{3}$,
Benjamin DAVISON$^{4}$,
Alex S. GARDNER$^{3}$,
Désirée TREICHLER$^{5}$,
Will KOCHTITZKY$^{6}$,
Brice VAN LIEFFERINGE$^{7}$,
Genyu WANG$^{8}$
Chang-Qing KE$^{8}$,
Xavier FETTWEIS$^{9}$,
Thorben DÖHNE$^{10}$,
Robert FAUSTO$^{11}$,
Damien RINGEISEN$^{1,12,13}$}

\affiliation{%
$^1$NASA Goddard Institute for Space Studies, New York, NY, USA\\
$^2$Autonomic Integra LLC, New York, NY, USA\\
$^3$Jet Propulsion Laboratory California Institute of Technology Pasadena, CA, USA\\
$^4$School of Geography and Planning, University of Sheffield, Sheffield, UK\\
$^5$Department of Geography, University of Oslo, Oslo, Norway\\
$^6$University of New England, Biddeford, Maine, USA\\
$^7$Laboratoire de Glaciologie, Université libre de Bruxelles (ULB), Brussels, Belgium\\
$^8$Nanjing University, Nanjing, Jiangsu, China\\
$^9$SPHERES research units, Geography Department, University of Liège, Liège, Belgium\\
$^{10}$TUD Dresden University of Technology, Dresden, Germany\\
$^{11}$Geological Survey of Denmark and Greenland, Copenhagen, Denmark\\
$^{12}$Center for Climate Systems Research, Columbia University, New York, NY, USA\\
$^{13}$Now at: Canadian Centre for Climate Modelling and Analysis, Environment and Climate Change Canada (ECCC), Victoria, British Columbia, Canada.\\
Correspondence: Ken Mankoff
\email{ken.mankoff@nasa.gov}}
#+END_EXPORT

:settings_drawer:
#+Latex_Class: igs
#+AUTHOR: 
#+DATE: 
#+LaTeX_CLASS_OPTIONS: [jog,oneside,review]
# #+LaTeX_CLASS_OPTIONS: [jog,oneside]
#+Options: toc:nil ^:t {}:t title:nil

#+EXPORT_FILE_NAME: ms.tex

#+EXCLUDE_TAGS: noexport

#+LATEX_HEADER_EXTRA: \usepackage[utf8]{inputenc}
#+LATEX_HEADER_EXTRA: \usepackage{mathabx}
#+LATEX_HEADER_EXTRA: \usepackage{graphicx}
#+LATEX_HEADER_EXTRA: \usepackage{siunitx}
#+LATEX_HEADER_EXTRA: % \setcounter{secnumdepth}{2}

#+LATEX_HEADER_EXTRA: \jourvolume{V}
** Uncertainty

#+begin_src jupyter-python :var tbl=README.org:gl_baseline :colnames no :exports none
import numpy as np
import pandas as pd

tbl = np.array(tbl)
df = pd.DataFrame(tbl[1:,1:], index=tbl[1:,0], columns=tbl[0,1:])

df = df.drop(columns=['Period','Source','IO'])

df = df.set_index('Term')
df = df[df['Value'] != '0']
df['Unc.'] = df['Unc.'].replace({'?':'100'})

for i,v in zip(df.index,df['Value']):
    df.loc[i,'Value'] = eval(v)
df['Value'] = df['Value'].astype(int)
df['Unc.'] = df['Unc.'].astype(int)

weight = (df['Value'] * df['Unc.']).sum() / df['Value'].sum()
print('GL:', weight)
#+END_SRC

#+RESULTS:
: GL: 17.1875

#+begin_src jupyter-python :var tbl=README.org:aq :colnames no :exports none
import numpy as np
import pandas as pd

tbl = np.array(tbl)
df = pd.DataFrame(tbl[1:,1:], index=tbl[1:,0], columns=tbl[0,1:])

df = df.drop(columns=['Period','Source','IO'])
df = df.set_index('Term')
df['Unc.'] = df['Unc.'].replace({'?':'100','5 -- 50':'100', '':'0'})

cols = ['East_g','West_g','Peninsula_g','East_s','West_s','Peninsula_s','Unc.']
for c in cols:
    df[c] = df[c].astype(int)

df['E'] = df['East_g'] + df['East_s']; df = df.drop(columns=['East_g', 'East_s'])
df['W'] = df['West_g'] + df['West_s']; df = df.drop(columns=['West_g', 'West_s'])
df['P'] = df['Peninsula_g'] + df['Peninsula_s']; df = df.drop(columns=['Peninsula_g', 'Peninsula_s'])
df['A'] = df['E'] + df['W'] + df['P']

cols = ['E','W','P','A']
for c in cols:
    weight = (df[c] * df['Unc.']).sum() / df[c].sum()
    print('AQ:', c, weight)
#+end_src

#+RESULTS:
: AQ: E 58.9046365661065
: AQ: W 71.11833010782416
: AQ: P 51.60362490149724
: AQ: A 62.458015267175576

Uncertainty on most individual terms is provided by the upstream data products and presented in the uncertainty ("Unc." column) in Tables \ref{tab:gl} and \ref{tab:aq}. The exceptions are calving and frontal melt in Greenland, net freshwater mass flow rate, and the derived mass loss and gain terms.

Calving and frontal melt uncertainty is 30 % between those two, but combined is 10 % constrained by the upstream discharge term (see Discussion > Uncertainty).

For net freshwater mass flow rate we use gross values for ice shelf basal melt and frontal retreat, treat each term as independent, and report the square root of the sum of the squared uncertainties.

For derived mass loss, mass gain, and uncertainty, traditional uncertainty propagation leads to unreasonably large numbers, because the values are large and the residual is small. We therefore estimate the residual uncertainty using the weighted uncertainty for each term in Tables \ref{tab:gl} and \ref{tab:aq}. Using this method, Greenland uncertainty is 15 %, and Antarctic uncertainty is 60 % in the East, 70 % in the west, 50 % in the Peninsula, and 60 % overall.

A comparison of our mass change and uncertainty results with mass change and uncertainty from the independent GMB method citep:groh_2019 shows an agreement between the two. Our uncertainty is consistently larger for the same domain, and our estimates well are within the GMB uncertainty (Table \ref{tab:results_mc}).

** Freshwater mass flow rate

Net freshwater export to the ocean (mass loss terms excluding sublimation and evaporation) is 1065 \pm120 Gt yr^{-1} for Greenland and 3110 \pm1515 Gt yr^{-1} for Antarctica. Antarctic sub-region values are also provided in Table \ref{tab:results_fw}, along with values in Sverdrup or 10^6 m^3 s^{-1}.

# Greenland table net freshwater flow
#+begin_src jupyter-python :var tbl=README.org:gl_baseline :colnames no :exports none
import numpy as np
import pandas as pd

tbl = np.array(tbl)
df = pd.DataFrame(tbl[1:,1:], index=tbl[1:,0], columns=tbl[0,1:])

df = df.drop(columns=['Period','Source'])

df = df.set_index('Term')
df = df[df['IO'] != 'I_g']
df = df[df['IO'] != '']
df = df[df['Value'] != '0']
df['Unc.'] = df['Unc.'].replace({'?':'100'})

for i,v in zip(df.index,df['Value']):
    df.loc[i,'Value'] = eval(v)
    df['Value'] = df['Value'].astype(int)
    df['Unc.'] = df['Unc.'].astype(int)
    df.loc['Ice shelf basal freeze-on', ['Value','Unc.']] = -1* df.loc['Ice shelf basal freeze-on', ['Value','Unc.']]

df['Err'] = df['Value'] * (df['Unc.']/100)
r = np.sum(unumpy.uarray(df['Value'].values, np.abs(df['Err'].values)))
print(r.n, r.s)
#+end_src

#+RESULTS:
: 1065.0 120.11921161912444

#+NAME:tab:results_fw
#+begin_src jupyter-python :var tbl=README.org:aq :colnames no :exports results
import numpy as np
import pandas as pd

tblout = pd.DataFrame(index=['Greenland','Antarctica','Antarctica East',
                            'Antarctica West','Antarctic Peninsula'],
                      columns=['FW','Err'])

tblout.loc['Greenland'] = [1065,120]

tbl = np.array(tbl)
df = pd.DataFrame(tbl[1:,1:], index=tbl[1:,0], columns=tbl[0,1:])

df = df.drop(columns=['Period','Source'])
df = df.set_index('Term')
df = df[df['IO'] != '']
df = df.drop(['Frontal melt','Sublimation','Evaporation'])
df['Unc.'] = df['Unc.'].replace({'?':'100'})

cols = ['East_g','West_g','Peninsula_g','East_s','West_s','Peninsula_s','Unc.']
for c in cols:
    df[c] = df[c].astype(int)

# frontal advance  and ice shelf basal freeze-on should be treated as negative outputs
cols = ['East_g','West_g','Peninsula_g','East_s','West_s','Peninsula_s']
df.loc['Frontal advance',cols] = -1*df.loc['Frontal advance',cols]
df.loc['Frontal advance','IO'] = 'O'
df.loc['Ice shelf basal freeze-on',cols] = -1*df.loc['Ice shelf basal freeze-on',cols]
df.loc['Ice shelf basal freeze-on','IO'] = 'O'

df.loc['Front adv and ret'] = df.loc['Frontal retreat'] + df.loc['Frontal advance']
df.loc['Front adv and ret','Unc.'] = df.loc['Frontal retreat','Unc.']
df.loc['Ice shelf melt and freeze'] = df.loc['Ice shelf basal melt'] + df.loc['Ice shelf basal freeze-on']
df.loc['Ice shelf melt and freeze','Unc.'] = df.loc['Ice shelf basal melt','Unc.']
df = df.drop(['Frontal advance','Frontal retreat','Ice shelf basal freeze-on','Ice shelf basal melt'])


df = df[df['IO'] != 'I']
df = df.drop(columns='IO')

for c in df.columns:
     df[c] = df[c].astype(int)
df['E'] = df['East_g'] + df['East_s']; df = df.drop(columns=['East_g', 'East_s'])
df['W'] = df['West_g'] + df['West_s']; df = df.drop(columns=['West_g', 'West_s'])
df['P'] = df['Peninsula_g'] + df['Peninsula_s']; df = df.drop(columns=['Peninsula_g', 'Peninsula_s'])
df['A'] = df['E'] + df['W'] + df['P']

r = np.sum(unumpy.uarray(df['E'].values, np.abs(df['E'].values * (df['Unc.']/100))))
tblout.loc['Antarctica East','FW'] = r.n
tblout.loc['Antarctica East','Err'] = r.s

r = np.sum(unumpy.uarray(df['W'].values, np.abs(df['W'].values * (df['Unc.']/100))))
tblout.loc['Antarctica West','FW'] = r.n
tblout.loc['Antarctica West','Err'] = r.s

r = np.sum(unumpy.uarray(df['P'].values, np.abs(df['P'].values * (df['Unc.']/100))))
tblout.loc['Antarctic Peninsula','FW'] = r.n
tblout.loc['Antarctic Peninsula','Err'] = r.s

r = np.sum(unumpy.uarray(df['A'].values, np.abs(df['A'].values * (df['Unc.']/100))))
tblout.loc['Antarctica','FW'] = r.n
tblout.loc['Antarctica','Err'] = r.s

tblout['Sv'] = tblout['FW'] * 0.0000316887
tblout['Sv Err'] = tblout['Err'] * 0.0000316887

tblout['FW'] = (tblout['FW']/5).round().astype(int)*5
tblout['Err'] = (tblout['Err']/5).round().astype(int)*5
tblout['Sv'] = tblout['Sv'].astype(float).round(3)
tblout['Sv Err'] = tblout['Sv Err'].astype(float).round(3)

tblout['FW'] = tblout['FW'].astype(str) + ' \pm' + tblout['Err'].astype(str)
tblout['Sv'] = tblout['Sv'].astype(str) + ' \pm' + tblout['Sv Err'].astype(str)
tblout = tblout.drop(columns=['Err','Sv Err'])

tblout = tblout.rename(columns={'FW':'Gt yr^{-1}'})
# df
tblout
#+end_src

#+ATTR_LATEX: :column{1}={gray9}
#+CAPTION: Net freshwater export mass flow rate for Greenland, Antarctica, and Antarctic regions in Gt yr^{-1} and Sverdrup (10^6 m^3 s^{-1}).\label{tab:results_fw}
#+RESULTS: tab:results_fw
|                         | Gt yr^{-1}   | Sv             |
|-------------------------+--------------+----------------|
| Greenland               | 1065 \pm120  | 0.034 \pm0.004 |
| Antarctica              | 3110 \pm1515 | 0.099 \pm0.048 |
| \phantom{Ant} East      | 1160 \pm480  | 0.037 \pm0.015 |
| \phantom{Ant} West      | 1420 \pm805  | 0.045 \pm0.026 |
| \phantom{Ant} Peninsula | 530 \pm225   | 0.017 \pm0.007 |

